

## **Ã‰tape 1 : Configurer une ACL standard numÃ©rotÃ©e**

Les ACLs standards filtrent le trafic en fonction de lâ€™adresse IP source uniquement. Cisco recommande de les placer aussi prÃ¨s que possible de la destination.

### **1. CrÃ©ation de lâ€™ACL sur R3**

Cette ACL permet aux rÃ©seaux **192.168.10.0/24** et **192.168.20.0/24** dâ€™accÃ©der au rÃ©seau **192.168.30.0/24**.  
Toute autre adresse IP est refusÃ©e par dÃ©faut avec **deny any**.

```bash
R3(config)# access-list 1 remark Autoriser lâ€™accÃ¨s des LANs de R1
R3(config)# access-list 1 permit 192.168.10.0 0.0.0.255
R3(config)# access-list 1 permit 192.168.20.0 0.0.0.255
R3(config)# access-list 1 deny any
```

ðŸ“Œ **Explication :**

- **access-list 1 remark** â†’ Ajoute un commentaire pour documenter la liste dâ€™accÃ¨s.
- **permit 192.168.10.0 0.0.0.255** â†’ Autorise tout le sous-rÃ©seau 192.168.10.0/24.
- **permit 192.168.20.0 0.0.0.255** â†’ Autorise tout le sous-rÃ©seau 192.168.20.0/24.
- **deny any** â†’ Bloque tout autre trafic non mentionnÃ© explicitement.

---

### **2. Appliquer lâ€™ACL Ã  lâ€™interface appropriÃ©e**

On applique cette ACL en sortie (**out**) sur **lâ€™interface GigabitEthernet 0/0/0** de R3.

```bash
R3(config)# interface g0/0/0
R3(config-if)# ip access-group 1 out
```

ðŸ“Œ **Explication :**

- **ip access-group 1 out** â†’ Applique la liste dâ€™accÃ¨s numÃ©ro **1** en sortie (**out**) de lâ€™interface.

---

### **3. VÃ©rifier lâ€™ACL**

Pour voir la liste des rÃ¨gles dÃ©finies dans lâ€™ACL **1** :

```bash
R3# show access-lists 1
```

Pour vÃ©rifier sur quelle interface lâ€™ACL est appliquÃ©e et dans quelle direction :

```bash
R3# show ip interface g0/0/0
```

ðŸ“Œ **Explication :**

- **show access-lists 1** â†’ Affiche les rÃ¨gles de lâ€™ACL numÃ©ro 1.
- **show ip interface g0/0/0** â†’ Montre les paramÃ¨tres de lâ€™interface, y compris les ACLs appliquÃ©es.

---

### **4. Tester lâ€™ACL**

VÃ©rifier si les hÃ´tes autorisÃ©s peuvent accÃ©der au rÃ©seau **192.168.30.0/24**.

1. **Depuis PC-A (192.168.10.x) â†’ ping PC-C (192.168.30.x)**
    
    ```bash
    PC-A> ping 192.168.30.3
    ```
    
2. **Depuis PC-B (192.168.20.x) â†’ ping PC-C (192.168.30.x)**
    
    ```bash
    PC-B> ping 192.168.30.3
    ```
    
3. **Depuis PC-D (rÃ©seau non autorisÃ©) â†’ ping PC-C**
    
    ```bash
    PC-D> ping 192.168.30.3
    ```
    
4. **Depuis R1 â†’ ping PC-C**
    
    ```bash
    R1# ping 192.168.30.3
    ```
    

ðŸ“Œ **Explication :**

- Si les pings des rÃ©seaux **192.168.10.0/24** et **192.168.20.0/24** rÃ©ussissent, lâ€™ACL fonctionne comme prÃ©vu.
- Si les pings de **PC-D** Ã©chouent, câ€™est normal car son rÃ©seau nâ€™est pas autorisÃ©.
- Le ping depuis **R1** doit Ã©chouer si son IP ne correspond pas aux rÃ©seaux autorisÃ©s.

---

## **Ã‰tape 2 : Configurer une ACL standard nommÃ©e**

Cette ACL permet :

- Au rÃ©seau **192.168.40.0/24** dâ€™accÃ©der au **192.168.10.0/24**.
- Seulement **PC-C (192.168.30.3)** peut aussi accÃ©der au **192.168.10.0/24**.

### **1. CrÃ©ation de lâ€™ACL nommÃ©e sur R1**

On utilise le nom **BRANCH-OFFICE-POLICY**.

```bash
R1(config)# ip access-list standard BRANCH-OFFICE-POLICY
R1(config-std-nacl)# permit host 192.168.30.3
R1(config-std-nacl)# permit 192.168.40.0 0.0.0.255
R1(config-std-nacl)# end
```

ðŸ“Œ **Explication :**

- **ip access-list standard BRANCH-OFFICE-POLICY** â†’ CrÃ©e une ACL nommÃ©e.
- **permit host 192.168.30.3** â†’ Autorise **uniquement PC-C** Ã  accÃ©der Ã  **192.168.10.0/24**.
- **permit 192.168.40.0 0.0.0.255** â†’ Autorise tout le sous-rÃ©seau **192.168.40.0/24**.

ðŸ’¡ **Autre faÃ§on dâ€™Ã©crire la premiÃ¨re rÃ¨gle :**

```bash
R1(config-std-nacl)# permit 192.168.30.3 0.0.0.0
```

Câ€™est Ã©quivalent Ã  **permit host 192.168.30.3**.

---

### **2. Appliquer lâ€™ACL sur lâ€™interface GigabitEthernet 0/0/0 de R1**

```bash
R1(config)# interface g0/0/0
R1(config-if)# ip access-group BRANCH-OFFICE-POLICY out
```

ðŸ“Œ **Explication :**

- **ip access-group BRANCH-OFFICE-POLICY out** â†’ Applique lâ€™ACL **en sortie** sur lâ€™interface.

---

### **3. VÃ©rifier lâ€™ACL**

```bash
R1# show access-lists
```

```bash
R1# show ip interface g0/0/0
```

ðŸ“Œ **Explication :**

- **show access-lists** â†’ Affiche les ACLs configurÃ©es sur le routeur.
- **show ip interface g0/0/0** â†’ VÃ©rifie lâ€™application de lâ€™ACL.

---

### **4. Tester lâ€™ACL**

1. **Depuis PC-C (192.168.30.3) â†’ ping PC-A (192.168.10.x)**
    
    ```bash
    PC-C> ping 192.168.10.3
    ```
    
2. **Depuis R3, tester en faisant un ping Ã©tendu avec source 192.168.30.1 vers PC-A**
    
    ```bash
    R3# ping
    Protocol [ip]: 
    Target IP address: 192.168.10.3
    Extended commands [n]: y
    Source address or interface: 192.168.30.1
    ```
    
3. **Depuis PC-D (192.168.40.x) â†’ ping PC-A**
    
    ```bash
    PC-D> ping 192.168.10.3
    ```
    



